run/DA0120/DA0120GasSc03/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "$FOAM_CASE/data/ablParams"

internalField   uniform $turbulentEpsilon;

boundaryField
{
    vapourInlet
    {
        type            zeroGradient;
    }
    frontField
    { 
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine         0;
            refColumn           0;  
            componentColumns    (1); 
            mergeSeparators     no;         
            file                "$FOAM_CASE/data/Eps.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
        direction        (0 0 1);
        origin           0;
    }
    frontField
    {
        type            zeroGradient;
    }
    backField
    {
        type            zeroGradient;
    }
    sideField
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedGradient;
	    gradient	uniform $epsilonShear;
    }
    ground
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }
    symPlane
    {
        type            symmetryPlane;
    }
}
// ************************************************************************* //
