run/DA0120/DA0120GasSc03/constant/reactions
species
(
    air
    SF6 
);

reactions
{}

