run/DA0120/DA0120GasSc03/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/data/ablParams"
//simulationType   laminar;
simulationType   RAS;

RAS
{
    RASModel        buoyantKEpsilon;
    buoyantKEpsilonCoeffs
    {
        sigmaEps $sigmaEps;
    }

    turbulence      on;
    printCoeffs     on;
}


// ************************************************************************* //
